laminarFlowOverPlate/system/blockMeshDict

/*--------------------------------*- C++ -*----------------------------------*/

// File was generated by SwiftBlock, a Blender 3D addon.

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

deltaT          1;

writeInterval   1;



// ************************************************************************* //


geometry
{
}
vertices
(
    (-1.0 0.7498807311058044 0.050000011920928955)
    (-0.5 -0.7498807311058044 0.050000011920928955)
    (-1.0 0.7498807311058044 -0.050000011920928955)
    (-0.5 0.7498807311058044 0.050000011920928955)
    (0.5 -0.7498807311058044 -0.050000011920928955)
    (0.5 -0.7498807311058044 0.050000011920928955)
    (0.5 0.7498807311058044 -0.050000011920928955)
    (0.5 0.7498807311058044 0.050000011920928955)
    (-1.0 0.7498807311058044 -0.050000011920928955)
    (-1.0 -0.7498807311058044 -0.050000011920928955)
    (-1.0 -0.7498807311058044 0.050000011920928955)
    (-1.0 0.7498807311058044 0.050000011920928955)
    (0.5 0.7498807311058044 -0.050000011920928955)
    (0.5 0.7498807311058044 0.050000011920928955)
    (0.5 -0.7498807311058044 -0.050000011920928955)
    (0.5 -0.7498807311058044 0.050000011920928955)
    (-1.0 -0.7498807311058044 0.050000011920928955)
    (-1.0 -0.7498807311058044 -0.050000011920928955)
    (7.5 0.7498807311058044 -0.050000011920928955)
    (7.5 0.7498807311058044 0.050000011920928955)
    (7.5 -0.7498807311058044 -0.050000011920928955)
    (7.5 -0.7498807311058044 0.050000011920928955)
);
edges
(
);
faces
(
);
blocks
(
// block id 0 
hex (0 2 12 13 16 17 14 15)  (1 15 100) edgeGrading (
(
 (0 0 1) (0 0 1) (1 2 0.826446) 
)
(
 (0 0 1) (0 0 1) (1 2 0.826446) 
)
(
 (0 0 1) (0 0 1) (1 2 0.826446) 
)
(
 (0 0 1) (0 0 1) (1 2 0.826446) 
)
(
 (0 0 1) (0 0 1) (1.5 16 0.217629) 
)
(
 (0 0 1) (0 0 1) (1.5 16 0.217629) 
)
(
 (0 0 1) (0 0 1) (1.5 16 0.217629) 
)
(
 (0 0 1) (0 0 1) (1.5 16 0.217629) 
)
(
 (0 0 1) (0.523486 70.7255 1) (0.0764183 29.2745 0.0675524) 
)
(
 (0 0 1) (0.523486 70.7255 1) (0.0764183 29.2745 0.0675524) 
)
(
 (0 0 1) (0.523486 70.7255 1) (0.0764183 29.2745 0.0675524) 
)
(
 (0 0 1) (0.523486 70.7255 1) (0.0764183 29.2745 0.0675524) 
)
)
// block id 1 
hex (12 13 15 14 18 19 21 20)  (1 100 85) edgeGrading (
(
 (1 2 1.21) (0 0 1) (0 0 1) 
)
(
 (1 2 1.21) (0 0 1) (0 0 1) 
)
(
 (1 2 1.21) (0 0 1) (0 0 1) 
)
(
 (1 2 1.21) (0 0 1) (0 0 1) 
)
(
 (0 0 1) (0.523486 70.7255 1) (0.0764183 29.2745 0.0675524) 
)
(
 (0 0 1) (0.523486 70.7255 1) (0.0764183 29.2745 0.0675524) 
)
(
 (0 0 1) (0.523486 70.7255 1) (0.0764183 29.2745 0.0675524) 
)
(
 (0 0 1) (0.523486 70.7255 1) (0.0764183 29.2745 0.0675524) 
)
(
 (1.19547 33.7346 22.645) (5.80453 51.2654 1) (0 0 1) 
)
(
 (1.19547 33.7346 22.645) (5.80453 51.2654 1) (0 0 1) 
)
(
 (1.19547 33.7346 22.645) (5.80453 51.2654 1) (0 0 1) 
)
(
 (1.19547 33.7346 22.645) (5.80453 51.2654 1) (0 0 1) 
)
)
);

patches
(
     patch Inlet
    (
        (2 17 16 0)
    )
     patch Outlet
    (
        (18 19 21 20)
    )
     empty front_back
    (
        (12 14 17 2)
        (15 13 0 16)
        (15 21 19 13)
        (12 18 20 14)
    )
     wall wall
    (
        (14 20 21 15)
    )
     patch top
    (
        (13 12 2 0)
        (13 19 18 12)
    )
     symmetry sym
    (
        (14 15 16 17)
    )
);