laminarFlowOverPlate/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    Inlet
    {
        type            patch;
        nFaces          100;
        startFace       19800;
    }
    Outlet
    {
        type            patch;
        nFaces          100;
        startFace       19900;
    }
    front_back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          20000;
        startFace       20000;
    }
    wall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          85;
        startFace       40000;
    }
    top
    {
        type            patch;
        nFaces          100;
        startFace       40085;
    }
    sym
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          15;
        startFace       40185;
    }
)

// ************************************************************************* //
