laminarFlowOverPlate/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    Inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }

    wall
    {
        type            noSlip;
    }

    front_back
    {
        type            empty;
    }
    sym
    {
        type            symmetry;
    }
    Outlet
    {
	type             zeroGradient;
    }
    top
    {
	type            fixedValue;
        value           uniform (1 0 0);
    }
}

// ************************************************************************* //
